[
    {
        "ISBN": "9780679724674",
        "Title": "The Black Jacobins",
        "Quantity": 1,
        "Description": "A powerful and impassioned historical account of the largest successful revolt by enslaved people in history: the Haitian Revolution of 1791–1803 “One of the seminal texts about the history of slavery and abolition.... Provocative and empowering.” —The New York Times Book Review The Black Jacobins, by Trinidadian historian C. L. R. James, was the first major analysis of the uprising that began in the wake of the storming of the Bastille in France and became the model for liberation movements from Africa to Cuba. It is the story of the French colony of San Domingo, a place where the brutality of plantation owners toward enslaved people was horrifyingly severe. And it is the story of a charismatic and barely literate enslaved person named Toussaint L’Ouverture, who successfully led the Black people of San Domingo against successive invasions by overwhelming French, Spanish, and English forces—and in the process helped form the first independent post-colonial nation in the Caribbean. With a new introduction (2023) by Professor David Scott.",
        "Authors": "C.L.R. James",
        "Publisher": "Vintage",
        "Published": "1989-01-01",
        "Bagged": "2022-11-20",
        "Pages": "448",
        "Language": "English",
        "Location": "Unknown",
        "Date": "04/01/2024 22:27:36"
    },
    {
        "ISBN": "9780143039389",
        "Title": "The Worst Journey in the World",
        "Quantity": 1,
        "Description": "A firsthand account of Scott's disastrous Antarctic expedition The Worst Journey in the World recounts Robert Falcon Scott’s ill-fated expedition to the South Pole. Apsley Cherry-Garrard—the youngest member of Scott’s team and one of three men to make and survive the notorious Winter Journey—draws on his firsthand experiences as well as the diaries of his compatriots to create a stirring and detailed account of Scott’s legendary expedition. Cherry himself would be among the search party that discovered the corpses of Scott and his men, who had long since perished from starvation and brutal cold. It is through Cherry’s insightful narrative and keen descriptions that Scott and the other members of the expedition are fully memorialized. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Authors": "Apsley Cherry-Garrard",
        "Publisher": "Penguin",
        "Published": "2006-02-28",
        "Bagged": "2023-07-21",
        "Pages": "644",
        "Language": "English",
        "Location": "Unknown",
        "Date": "03/01/2024 18:36:05"
    },
    {
        "ISBN": "9781594633942",
        "Title": "A Brief History of Seven Killings",
        "Quantity": 1,
        "Description": "Winner of the Man Booker Prize One of Entertainment Weekly's Top 10 Books of the Decade One of the Top 10 Books of 2014 – Michiko Kakutani, The New York Times A “thrilling, ambitious . . . intense” (Los Angeles Times) novel that explores the attempted assassination of Bob Marley in the late 1970s, from the author of Black Leopard, Red Wolf In A Brief History of Seven Killings, Marlon James combines masterful storytelling with his unrivaled skill at characterization and his meticulous eye for detail to forge a novel of dazzling ambition and scope. On December 3, 1976, just before the Jamaican general election and two days before Bob Marley was to play the Smile Jamaica Concert to ease political tensions in Kingston, seven unnamed gunmen stormed the singer’s house, machine guns blazing. The attack wounded Marley, his wife, and his manager, and injured several others. Little was officially released about the gunmen, but rumors abounded regarding the assassins’ fates. A Brief History of Seven Killings is James’s fictional exploration of that dangerous and unstable time in Jamaica’s history and beyond. Deftly spanning decades and continents and peopled with a wide range of characters—assassins, drug dealers, journalists, and even ghosts—James brings to life the people who walked the streets of 1970s Kingston, who dominated the crack houses of 1980s New York, and who reemerged into a radically altered Jamaica of the 1990s. Brilliantly inventive, A Brief History of Seven Killings is an “exhilarating” (The New York Times) epic that’s been called “a tour de force” (The Wall Street Journal).",
        "Authors": "Marlon James",
        "Publisher": "Penguin",
        "Published": "2015-09-08",
        "Bagged": "2018-01-31",
        "Pages": "704",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:35:37"
    },
    {
        "ISBN": "9781594484360",
        "Title": "The Book of Night Women",
        "Quantity": 1,
        "Description": "From the author of the National Book Award finalist Black Leopard, Red Wolf and the WINNER of the 2015 Man Booker Prize for A Brief History of Seven Killings \"An undeniable success.” — The New York Times Book Review A true triumph of voice and storytelling, The Book of Night Women rings with both profound authenticity and a distinctly contemporary energy. It is the story of Lilith, born into slavery on a Jamaican sugar plantation at the end of the eighteenth century. Even at her birth, the slave women around her recognize a dark power that they- and she-will come to both revere and fear. The Night Women, as they call themselves, have long been plotting a slave revolt, and as Lilith comes of age they see her as the key to their plans. But when she begins to understand her own feelings, desires, and identity, Lilith starts to push at the edges of what is imaginable for the life of a slave woman, and risks becoming the conspiracy's weak link. But the real revelation of the book-the secret to the stirring imagery and insistent prose-is Marlon James himself, a young writer at once breath­takingly daring and wholly in command of his craft.",
        "Authors": "Marlon James",
        "Publisher": "National Geographic Books",
        "Published": "2010-02-02",
        "Bagged": "2020-01-31",
        "Pages": "",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:36:11"
    },
    {
        "ISBN": "9780679732242",
        "Title": "The Sound and the Fury",
        "Quantity": 1,
        "Description": "Design manuscript, setting copy, four galley proofs, page proof, blue line and two reproduction proofs for the corrected edition of the novel edited by Noel Polk.",
        "Authors": "William Faulkner",
        "Publisher": "Random House Digital, Inc.",
        "Published": "1984-01-01",
        "Bagged": "2019-01-31",
        "Pages": "326",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:36:31"
    },
    {
        "ISBN": "9780375725807",
        "Title": "Underground",
        "Quantity": 1,
        "Description": "In this haunting work of journalistic investigation, Haruki Murakami tells the story of the horrific terrorist attack on Japanese soil that shook the entire world. On a clear spring day in 1995, five members of a religious cult unleashed poison gas on the Tokyo subway system. In attempt to discover why, Haruki Murakmi talks to the people who lived through the catastrophe, and in so doing lays bare the Japanese psyche. As he discerns the fundamental issues that led to the attack, Murakami paints a clear vision of an event that could occur anytime, anywhere.",
        "Authors": "Haruki Murakami",
        "Publisher": "Vintage",
        "Published": "2001-04-10",
        "Bagged": "2023-03-16",
        "Pages": "",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:36:50"
    },
    {
        "ISBN": "9780385498203",
        "Title": "John Henry Days",
        "Quantity": 1,
        "Description": "From the bestselling, two-time Pulitzer Prize-winning author of The Underground Railroad and The Nickel Boys, a novel that is \"funny and wise and sumptuously written\" (Jonathan Franzen, The New York Times Book Review). Colson Whitehead’s triumphant novel is on one level a multifaceted retelling of the story of John Henry, the black steel-driver who died outracing a machine designed to replace him. On another level it’s the story of a disaffected, middle-aged black journalist on a mission to set a record for junketeering who attends the annual John Henry Days festival. It is also a high-velocity thrill ride through the tunnel where American legend gives way to American pop culture, replete with p. r. flacks, stamp collectors, blues men , and turn-of-the-century song pluggers. John Henry Days is an acrobatic, intellectually dazzling, and laugh-out-loud funny book that will be read and talked about for years to come. Look for Colson Whitehead’s bestselling new novel, Harlem Shuffle!",
        "Authors": "Colson Whitehead",
        "Publisher": "Anchor",
        "Published": "2001-01-01",
        "Bagged": "2023-01-15",
        "Pages": "404",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:37:06"
    },
    {
        "ISBN": "9780520071667",
        "Title": "Alexander of Macedon, 356-323 b.c.",
        "Quantity": 1,
        "Description": "This biography portrays Alexander as both a complex personality and a single-minded general, a man capable of such diverse expediencies as patricide or the massacre of civilians. Writing for the general reader, the author provides gritty details on Alexander's darker side while providing a gripping tale of Alexander's career.",
        "Authors": "Peter Green",
        "Publisher": "Univ of California Press",
        "Published": "1991-01-01",
        "Bagged": "2022-01-31",
        "Pages": "668",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:37:17"
    },
    {
        "ISBN": "9781632864239",
        "Title": "The Cultural Revolution",
        "Quantity": 1,
        "Description": "The concluding volume--following Mao's Great Famine and The Tragedy of Liberation--in Frank Dikötter's award-winning trilogy chronicling the Communist revolution in China. After the economic disaster of the Great Leap Forward that claimed tens of millions of lives from 1958–1962, an aging Mao Zedong launched an ambitious scheme to shore up his reputation and eliminate those he viewed as a threat to his legacy. The Cultural Revolution's goal was to purge the country of bourgeois, capitalistic elements he claimed were threatening genuine communist ideology. Young students formed the Red Guards, vowing to defend the Chairman to the death, but soon rival factions started fighting each other in the streets with semiautomatic weapons in the name of revolutionary purity. As the country descended into chaos, the military intervened, turning China into a garrison state marked by bloody purges that crushed as many as one in fifty people. The Cultural Revolution: A People's History, 1962–1976 draws for the first time on hundreds of previously classified party documents, from secret police reports to unexpurgated versions of leadership speeches. After the army itself fell victim to the Cultural Revolution, ordinary people used the political chaos to resurrect the market and hollow out the party's ideology. By showing how economic reform from below was an unintended consequence of a decade of violent purges and entrenched fear, The Cultural Revolution casts China's most tumultuous era in a wholly new light.",
        "Authors": "Frank Dikötter",
        "Publisher": "Bloomsbury Press",
        "Published": "2017-06-06",
        "Bagged": "2022-01-31",
        "Pages": "433",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:37:35"
    },
    {
        "ISBN": "9780195094824",
        "Title": "Cuba",
        "Quantity": 1,
        "Description": "This overview of Cuban history and politics has been updated and revised to include a new afterword on the current political situation and an expanded guide to selected reference literature.",
        "Authors": "Louis A. Pérez",
        "Publisher": "Oxford University Press, USA",
        "Published": "1995-01-01",
        "Bagged": "2022-01-31",
        "Pages": "539",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:37:47"
    },
    {
        "ISBN": "9780316013321",
        "Title": "Consider the Lobster",
        "Quantity": 1,
        "Description": "A collection of essays by the award-winning author of Infinite Jest shares whimsical and biting observations about such topics as the Bush-Kerry presidential race, the pain experienced by lobsters while they are being prepared for the feast, and Franz Kafka's questionable sense of humor. Reprint.",
        "Authors": "David Foster Wallace",
        "Publisher": "Back Bay Books",
        "Published": "2007-07-02",
        "Bagged": "2015-01-31",
        "Pages": "342",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:37:55"
    },
    {
        "ISBN": "9780395859964",
        "Title": "The Journals of Lewis and Clark",
        "Quantity": 1,
        "Description": "Primary source.",
        "Authors": "Meriwether Lewis, William Clark",
        "Publisher": "Mariner Books",
        "Published": "1997-01-01",
        "Bagged": "2020-06-11",
        "Pages": "504",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:38:31"
    },
    {
        "ISBN": "9780316925198",
        "Title": "Brief Interviews with Hideous Men",
        "Quantity": 1,
        "Description": "David Foster Wallace made an art of taking readers into places no other writer even gets near. The series of stories from which this exuberantly acclaimed book takes its title is a sequence of imagined interviews with men on the subject of their relations with women. These portraits of men at their most self-justifying, loquacious, and benighted explore poignantly and hilariously the agonies of sexual connections.",
        "Authors": "David Foster Wallace",
        "Publisher": "Back Bay Books",
        "Published": "2000-04-01",
        "Bagged": "2015-01-31",
        "Pages": "336",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:38:39"
    },
    {
        "ISBN": "9780679772699",
        "Title": "A Short History of Byzantium",
        "Quantity": 1,
        "Description": "\"Norwich is always on the lookout for the small but revealing details. . . . All of this he recounts in a style that consistently entertains.\" --The New York Times Book Review In this magisterial adaptation of his epic three-volume history of Byzantium, John Julius Norwich chronicles the world's longest-lived Christian empire. Beginning with Constantine the Great, who in a.d. 330 made Christianity the religion of his realm and then transferred its capital to the city that would bear his name, Norwich follows the course of eleven centuries of Byzantine statecraft and warfare, politics and theology, manners and art. In the pages of A Short History of Byzantium we encounter mystics and philosophers, eunuchs and barbarians, and rulers of fantastic erudition, piety, and degeneracy. We enter the life of an empire that could create some of the world's most transcendent religious art and then destroy it in the convulsions of fanaticism. Stylishly written and overflowing with drama, pathos, and wit, here is a matchless account of a lost civilization and its magnificent cultural legacy. \"Strange and fascinating . . . filled with drollery and horror.\" --Boston Globe",
        "Authors": "John Julius Norwich",
        "Publisher": "National Geographic Books",
        "Published": "1998-12-29",
        "Bagged": "2017-01-31",
        "Pages": "",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:38:47"
    },
    {
        "ISBN": "9780804170147",
        "Title": "Wind/pinball",
        "Quantity": 1,
        "Description": "NATIONAL BESTSELLER Wind/Pinball, a unique two-in-one volume, includes, on one side, Murakami’s first novel Hear the Wind Sing. When you flip the book over, you can read his second novel, Pinball, 1973. Each book has its own stunning cover. In the spring of 1978, a young Haruki Murakami sat down at his kitchen table and began to write. The result: two remarkable short novels—Hear the Wind Sing and Pinball, 1973—that launched the career of one of the most acclaimed authors of our time. These powerful, at times surreal, works about two young men coming of age—the unnamed narrator and his friend the Rat—are stories of loneliness, obsession, and eroticism. They bear all the hallmarks of Murakami’s later books, and form the first two-thirds, with A Wild Sheep Chase, of the trilogy of the Rat. Widely available in English for the first time ever, newly translated, and featuring a new introduction by Murakami himself, Wind/Pinball gives us a fascinating insight into a great writer’s beginnings.",
        "Authors": "Haruki Murakami",
        "Publisher": "National Geographic Books",
        "Published": "2016-05-03",
        "Bagged": "2019-01-31",
        "Pages": "",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:39:16"
    },
    {
        "ISBN": "9780460874779",
        "Title": "The Heart of Darkness",
        "Quantity": 1,
        "Description": "Did he live his life through in every detail of desire, temptation and surrender during that supreme moment of complete knowledge? He cried whisperingly at some image at some vision,–he cried twice, with a cry that was no more than a breath– \"The horror! The Horror!\" Charles Marlow's journey into the heart of Africa is odyssey into corruption, absurdity the Africans and conspiring against each other; he voyages upstream on a paddle–steamer that comes under lethal attack; and he encounters the great idealist, Mr. Kurtz, the genius who seemed to represent the best Europe. But Mr. Kurtz has 'taken a high seat among the devils of the land,' and Marlow returns to Europe bearing the burden of appalling knowledge, forced to make his 'choice of nightmares.' Conrad's critical tale of self inspired the far-reaching film Apocalypse Now as well as generations of critical discussion. A comprehensive paperback edition, with introduction notes, selected criticism, text summary and chronology of Conrad's life and times",
        "Authors": "Joseph Conrad",
        "Publisher": "Everyman Paperback",
        "Published": "1995-02-02",
        "Bagged": "2015-01-31",
        "Pages": "176",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:39:27"
    },
    {
        "ISBN": "9780142437803",
        "Title": "Ethan Frome",
        "Quantity": 1,
        "Description": "\"First published in the United States of America by Charles Scribner's Sons 1911\"--Title page verso.",
        "Authors": "Edith Wharton",
        "Publisher": "Penguin Classics",
        "Published": "2005-01-01",
        "Bagged": "2016-01-31",
        "Pages": "136",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:39:36"
    },
    {
        "ISBN": "9780345806567",
        "Title": "Giovanni's Room",
        "Quantity": 1,
        "Description": "",
        "Authors": "James Baldwin",
        "Publisher": "Dial Press, N.Y.",
        "Published": "1956-01-01",
        "Bagged": "2018-01-31",
        "Pages": "",
        "Language": "",
        "Location": "Unknown",
        "Date": "27/03/2023 14:39:44"
    },
    {
        "ISBN": "9780060970635",
        "Title": "The Old Gringo",
        "Quantity": 1,
        "Description": "Set during the Mexican Revolution, a frustrated spinster, a retired journalist, and a fiery young general are inexplicably drawn together as they face love, death and war",
        "Authors": "Carlos Fuentes",
        "Publisher": "Perennial Library, Harper & Row, New York",
        "Published": "1989-01-01",
        "Bagged": "2020-11-26",
        "Pages": "199",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:39:52"
    },
    {
        "ISBN": "9781788736572",
        "Title": "The Haitian Revolution",
        "Quantity": 1,
        "Description": "Toussaint L’Ouverture was the leader of the Haitian Revolution in the late eighteenth century, in which slaves rebelled against their masters and established the first black republic. In this collection of his writings and speeches, former Haitian politician Jean-Bertrand Aristide demonstrates L’Ouverture’s profound contribution to the struggle for equality.",
        "Authors": "Toussaint L'Ouverture",
        "Publisher": "Verso Books",
        "Published": "2019-11-12",
        "Bagged": "2021-08-19",
        "Pages": "177",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:40:00"
    },
    {
        "ISBN": "9781616953492",
        "Title": "The Farming of Bones",
        "Quantity": 1,
        "Description": "It is 1937 and Amabelle Désir, a young Haitian woman living in the Dominican Republic, has built herself a life as the servant and companion of the wife of a wealthy colonel. She and Sebastien, a cane worker, are deeply in love and plan to marry. But Amabelle's world collapses when a wave of genocidal violence, driven by Dominican dictator Rafael Trujillo, leads to the slaughter of Haitian workers. Amabelle and Sebastien are separated, and she desperately flees the tide of violence for a Haiti she barely remembers. Already acknowledged as a classic, this harrowing story of love and survival—from one of the most important voices of her generation—is an unforgettable memorial to the victims of the Parsley Massacre and a testimony to the power of human memory.",
        "Authors": "Edwidge Danticat",
        "Publisher": "National Geographic Books",
        "Published": "2013-05-07",
        "Bagged": "2019-01-31",
        "Pages": "",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:40:23"
    },
    {
        "ISBN": "9780140446159",
        "Title": "The Count of Monte Cristo",
        "Quantity": 1,
        "Description": "Edmund Dantes, unjustly convicted of aiding the exiled Napoleon, escapes after fourteen years in prison and seeks his revenge in Paris",
        "Authors": "Alexandre Dumas",
        "Publisher": "Penguin Classics",
        "Published": "1996-01-01",
        "Bagged": "2019-01-31",
        "Pages": "1102",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:40:32"
    },
    {
        "ISBN": "9780060929800",
        "Title": "Native Son",
        "Quantity": 1,
        "Description": "Right from the start, Bigger Thomas had been headed for jail. It could have been for assault or petty larceny; by chance, it was for murder and rape. Native Son tells the story of this young black man caught in a downward spiral after he kills a young white woman in a brief moment of panic. Set in Chicago in the 1930s, Wright's powerful novel is an unsparing reflection on the poverty and feelings of hopelessness experienced by people in inner cities across the country and of what it means to be black in America.",
        "Authors": "Richard A. Wright",
        "Publisher": "Harper Perennial Modern Classics",
        "Published": "1998-09-01",
        "Bagged": "2018-01-31",
        "Pages": "528",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:42:33"
    },
    {
        "ISBN": "9780679728757",
        "Title": "Blood Meridian, or, the Evening Redness in the West",
        "Quantity": 1,
        "Description": "Based on incidents that took place in the southwestern United States and Mexico around 1850, this novel chronicles the crimes of a band of desperados, with a particular focus on one, \"the kid,\" a boy of fourteen",
        "Authors": "Cormac McCarthy",
        "Publisher": "Vintage",
        "Published": "1992-01-01",
        "Bagged": "2016-01-31",
        "Pages": "337",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:42:53"
    },
    {
        "ISBN": "9781400034307",
        "Title": "Brother, I'm Dying",
        "Quantity": 1,
        "Description": "Winner of the National Book Critics Circle Award for Autobiography A National Book Award Finalist A New York Times Notable Book From the age of four, award-winning writer Edwidge Danticat came to think of her uncle Joseph as her “second father,” when she was placed in his care after her parents left Haiti for America. And so she was both elated and saddened when, at twelve, she joined her parents and youngest brothers in New York City. As Edwidge made a life in a new country, adjusting to being far away from so many who she loved, she and her family continued to fear for the safety of those still in Haiti as the political situation deteriorated. In 2004, they entered into a terrifying tale of good people caught up in events beyond their control. Brother I'm Dying is an astonishing true-life epic, told on an intimate scale by one of our finest writers.",
        "Authors": "Edwidge Danticat",
        "Publisher": "National Geographic Books",
        "Published": "2008-09-09",
        "Bagged": "2020-03-19",
        "Pages": "",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:43:17"
    },
    {
        "ISBN": "9780060539252",
        "Title": "The Outsider",
        "Quantity": 1,
        "Description": "Wright presents a compelling story of a black man's attempt to escape his past and start anew in Harlem. Cross Damon is a man at odds with society and with himself, a man who hungers for peace but who brings terror and destruction wherever he goes. As Maryemma Graham writes in her Introduction to this edition, with its restored text established by the Library of America, \"The Outsider is Richard Wright's second installment in a story of epic proportions, a complex master narrative designed to show American racism in raw and ugly terms ... The stories of Bigger Thomas ... and Cross Damon bear an uncanny resemblance to many contemporary cases of street crime and violence. There is also a prophetic note in Wright's construction of the criminal mind as intelligent, introspective, and transformative.\" In addition to the Introduction by Maryemma Graham, this edition includes a notes section by Arnold Rampersad.",
        "Authors": "Richard Wright",
        "Publisher": "Harper Collins",
        "Published": "2003-07-29",
        "Bagged": "2015-01-31",
        "Pages": "676",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:43:30"
    },
    {
        "ISBN": "9780143116936",
        "Title": "The Broom of the System",
        "Quantity": 1,
        "Description": "The \"dazzling, exhilarating\" (San Francisco Chronicle) debut novel from one of this century's most groundbreaking writers Published when David Foster Wallace was just twenty-four years old, The Broom of the System stunned critics and marked the emergence of an extraordinary new talent. At the center of this outlandishly funny, fiercely intelligent novel is the bewitching heroine, Lenore Stonecipher Beadsman. The year is 1990 and the place is a slightly altered Cleveland, Ohio. Lenore’s great-grandmother has disappeared with twenty-five other inmates of the Shaker Heights Nursing Home. Her beau, and boss, Rick Vigorous, is insanely jealous, and her cockatiel, Vlad the Impaler, has suddenly started spouting a mixture of psycho-babble, Auden, and the King James Bible. Ingenious and entertaining, this debut from one of the most innovative writers of his generation brilliantly explores the paradoxes of language, storytelling, and reality.",
        "Authors": "David Foster Wallace",
        "Publisher": "National Geographic Books",
        "Published": "2010-06-29",
        "Bagged": "2019-01-31",
        "Pages": "",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:43:42"
    },
    {
        "ISBN": "9781400079278",
        "Title": "Kafka on the Shore",
        "Quantity": 1,
        "Description": "An unlikely alliance forms between Kafka Tamura, a fifteen-year-old runaway, and the aging Nakata, a man who has never recovered from a wartime affliction, as they embark on a surreal odyssey through a strange, fantastical world.",
        "Authors": "Haruki Murakami",
        "Publisher": "Vintage",
        "Published": "2006-01-01",
        "Bagged": "2017-01-31",
        "Pages": "467",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:43:55"
    },
    {
        "ISBN": "9780060929787",
        "Title": "Black Boy",
        "Quantity": 1,
        "Description": "Richard Wright describes what it was like growing up in Jim Crow-era Mississippi.",
        "Authors": "Richard Wright",
        "Publisher": "Harper Collins",
        "Published": "1998-01-01",
        "Bagged": "2021-02-18",
        "Pages": "450",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:44:28"
    },
    {
        "ISBN": "9781905583577",
        "Title": "The Book of Tokyo",
        "Quantity": 1,
        "Description": "A shape-shifter arrives at Tokyo harbour in human form, set to embark on an unstoppable rampage through the city’s train network… A young woman is accompanied home one night by a reclusive student, and finds herself lured into a flat full of eerie Egyptian artefacts… A man suspects his young wife’s obsession with picnicking every weekend in the city’s parks hides a darker motive… At first, Tokyo appears in these stories as it does to many outsiders: a city of bewildering scale, awe-inspiring modernity, peculiar rules, unknowable secrets and, to some extent, danger. Characters observe their fellow citizens from afar, hesitant to stray from their daily routines to engage with them. But Tokyo being the city it is, random encounters inevitably take place – a naïve book collector, mistaken for a French speaker, is drawn into a world he never knew existed; a woman seeking psychiatric help finds herself in a taxi with an older man wanting to share his own peculiar revelations; a depressed divorcee accepts an unexpected lunch invitation to try Thai food for the very first time… The result in each story is a small but crucial change in perspective, a sampling of the unexpected yet simple pleasure of other people’s company. As one character puts it, ‘The world is full of delicious things, you know.’",
        "Authors": "Hideo Furukawa, Kaori Ekuni, Mitsuyo Kakuta, Banana Yoshimoto, Toshiyuki Horie, Nao-Cola Yamazaki, Hitomi Kanehara, Osamu Hashimoto, Hiromi Kawakami, Shuichi Yoshida",
        "Publisher": "Comma Press",
        "Published": "2015-06-12",
        "Bagged": "2018-01-31",
        "Pages": "169",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:44:43"
    },
    {
        "ISBN": "9780679744399",
        "Title": "All the Pretty Horses",
        "Quantity": 1,
        "Description": "Cut off from the life of ranching he has come to love by his grandfather's death, John Grady Cole flees to Mexico, where he and his two companions embark on a rugged and cruelly idyllic adventure",
        "Authors": "Cormac McCarthy",
        "Publisher": "Vintage",
        "Published": "1993-01-01",
        "Bagged": "2017-01-31",
        "Pages": "301",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:44:53"
    },
    {
        "ISBN": "9780156031790",
        "Title": "Strange Angel",
        "Quantity": 1,
        "Description": "Traces the life story of the rocket scientist whose work was dismissed after his accidental death revealed his occult beliefs, discussing his contributions to rocketry and his participation in the occult community of 1930s Los Angeles.",
        "Authors": "George Pendle",
        "Publisher": "Houghton Mifflin Harcourt",
        "Published": "2006-02-01",
        "Bagged": "2020-01-31",
        "Pages": "380",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:45:03"
    },
    {
        "ISBN": "9780060854942",
        "Title": "Continental Drift",
        "Quantity": 1,
        "Description": "A powerful literary classic from one of contemporary fiction's most acclaimed and important writers, Russell Banks's Continental Drift is a masterful novel of hope lost and gained, and a gripping, indelible story of fragile lives uprooted and transformed by injustice, disappointment, and the seductions and realities of the American dream.",
        "Authors": "Russell Banks",
        "Publisher": "Harper Perennial Modern Classics",
        "Published": "2007-03-13",
        "Bagged": "2021-01-04",
        "Pages": "448",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:45:17"
    },
    {
        "ISBN": "9780307389732",
        "Title": "Love in the Time of Cholera",
        "Quantity": 1,
        "Description": "Set on the Caribbean coast of South America, this love story brings together Fermina Daza, her distinguished husband, and a man who has secretly loved her for more than fifty years.",
        "Authors": "Gabriel García Márquez",
        "Publisher": "Vintage",
        "Published": "2003-01-01",
        "Bagged": "2021-01-16",
        "Pages": "348",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:46:13"
    },
    {
        "ISBN": "9780061857645",
        "Title": "Lost Memory of Skin",
        "Quantity": 1,
        "Description": "After doing time for a liaison with an underage girl, the Kid is forbidden to live within 2,500 feet of anywhere children might gather. Barely beyond childhood himself, the Kid is in many ways an innocent, trapped by impulses and choices he struggles to comprehend. Enter the Professor, a man who has built his own life on secrets and lies. The two men forge a tentative partnership, but when the Professor's past resurfaces, the balance in the two men's relationship shifts. Suddenly, the Kid must reconsider all he has come to believe, and make a fateful choice when faced with a new kind of moral decision. A mature and masterful work of contemporary fiction from one of our most accomplished storytellers, Lost Memory of Skin explores the zeitgeist of a troubled society where zero tolerance has erased any hope of subtlety and compassion—a society where isolating the offender has perhaps created a new kind of victim.",
        "Authors": "Russell Banks",
        "Publisher": "Ecco",
        "Published": "2012-07-17",
        "Bagged": "2021-01-31",
        "Pages": "",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:46:29"
    },
    {
        "ISBN": "9780142004234",
        "Title": "East of Eden",
        "Quantity": 1,
        "Description": "A masterpiece of Biblical scope, and the magnum opus of one of America’s most enduring authors, in a deluxe Centennial edition In his journal, Nobel Prize winner John Steinbeck called East of Eden \"the first book,\" and indeed it has the primordial power and simplicity of myth. Set in the rich farmland of California's Salinas Valley, this sprawling and often brutal novel follows the intertwined destinies of two families—the Trasks and the Hamiltons—whose generations helplessly reenact the fall of Adam and Eve and the poisonous rivalry of Cain and Abel. The masterpiece of Steinbeck’s later years, East of Eden is a work in which Steinbeck created his most mesmerizing characters and explored his most enduring themes: the mystery of identity, the inexplicability of love, and the murderous consequences of love's absence. Adapted for the 1955 film directed by Elia Kazan introducing James Dean, and read by thousands as the book that brought Oprah’s Book Club back, East of Eden has remained vitally present in American culture for over half a century. This Centennial edition, specially designed to commemorate one hundred years of Steinbeck, features french flaps and deckle-edged pages. For more than sixty-five years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,500 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translato",
        "Authors": "John Steinbeck",
        "Publisher": "Penguin Books",
        "Published": "1980-01-01",
        "Bagged": "2022-09-27",
        "Pages": "608",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:47:25"
    },
    {
        "ISBN": "9780142000663",
        "Title": "The Grapes of Wrath",
        "Quantity": 1,
        "Description": "The Pulitzer Prize-winning epic of the Great Depression, a book that galvanized—and sometimes outraged—millions of readers. First published in 1939, Steinbeck’s Pulitzer Prize-winning epic of the Great Depression chronicles the Dust Bowl migration of the 1930s and tells the story of one Oklahoma farm family, the Joads—driven from their homestead and forced to travel west to the promised land of California. Out of their trials and their repeated collisions against the hard realities of an America divided into Haves and Have-Nots evolves a drama that is intensely human yet majestic in its scale and moral vision, elemental yet plainspoken, tragic but ultimately stirring in its human dignity. A portrait of the conflict between the powerful and the powerless, of one man’s fierce reaction to injustice, and of one woman’s stoical strength, the novel captures the horrors of the Great Depression and probes into the very nature of equality and justice in America. At once a naturalistic epic, captivity narrative, road novel, and transcendental gospel, Steinbeck’s powerful landmark novel is perhaps the most American of American Classics. This Centennial edition, specially designed to commemorate one hundred years of Steinbeck, features french flaps and deckle-edged pages. For more than sixty-five years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,500 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
        "Authors": "John Steinbeck",
        "Publisher": "Penguin Books",
        "Published": "2002-01-08",
        "Bagged": "2021-01-31",
        "Pages": "464",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:47:37"
    },
    {
        "ISBN": "9780099448785",
        "Title": "Hard-Boiled Wonderland and the End of the World",
        "Quantity": 1,
        "Description": "The contemporary and the mythic collide in this hard-boiled tale of computers and conspiracy theories, unicorns and ancient lands.",
        "Authors": "Haruki Murakami",
        "Publisher": "Random House",
        "Published": "2003-01-01",
        "Bagged": "2018-01-31",
        "Pages": "400",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:47:52"
    },
    {
        "ISBN": "9780393339284",
        "Title": "Everything and More: a Compact History of Infinity",
        "Quantity": 1,
        "Description": "The bestselling author of \"Infinite Jest\" takes on the 2,000 year-old quest to understand infinity. Wallace brings his considerable talents to the history of one of math's most enduring puzzles: the seemingly paradoxical nature of infinity.",
        "Authors": "David Foster Wallace, Neal Stephenson",
        "Publisher": "W. W. Norton & Company",
        "Published": "2010-10-04",
        "Bagged": "2017-01-31",
        "Pages": "344",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:48:05"
    },
    {
        "ISBN": "9780062316110",
        "Title": "Sapiens",
        "Quantity": 1,
        "Description": "Official U.S. edition with full color illustrations throughout. #1 New York Times Bestseller The Summer Reading Pick for President Barack Obama, Bill Gates, and Mark Zuckerberg, now available as a beautifully packaged paperback From a renowned historian comes a groundbreaking narrative of humanity’s creation and evolution—a #1 international bestseller—that explores the ways in which biology and history have defined us and enhanced our understanding of what it means to be “human.” One hundred thousand years ago, at least six different species of humans inhabited Earth. Yet today there is only one—homo sapiens. What happened to the others? And what may happen to us? Most books about the history of humanity pursue either a historical or a biological approach, but Dr. Yuval Noah Harari breaks the mold with this highly original book that begins about 70,000 years ago with the appearance of modern cognition. From examining the role evolving humans have played in the global ecosystem to charting the rise of empires, Sapiens integrates history and science to reconsider accepted narratives, connect past developments with contemporary concerns, and examine specific events within the context of larger ideas. Dr. Harari also compels us to look ahead, because over the last few decades humans have begun to bend laws of natural selection that have governed life for the past four billion years. We are acquiring the ability to design not only the world around us, but also ourselves. Where is this leading us, and what do we want to become? Featuring 27 photographs, 6 maps, and 25 illustrations/diagrams, this provocative and insightful work is sure to spark debate and is essential reading for aficionados of Jared Diamond, James Gleick, Matt Ridley, Robert Wright, and Sharon Moalem.",
        "Authors": "Yuval Noah Harari",
        "Publisher": "Harper Perennial",
        "Published": "2018-05-15",
        "Bagged": "2020-01-31",
        "Pages": "464",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:48:20"
    },
    {
        "ISBN": "9781788732482",
        "Title": "The Common Wind",
        "Quantity": 1,
        "Description": "Winner of the 2019 Stone Book Award, Museum of African American History A remarkable intellectual history of the slave revolts that made the modern revolutionary era The Common Wind is a gripping and colorful account of the intercontinental networks that tied together the free and enslaved masses of the New World. Having delved deep into the gray obscurity of official eighteenth-century records in Spanish, English, and French, Julius S. Scott has written a powerful “history from below.” Scott follows the spread of “rumors of emancipation” and the people behind them, bringing to life the protagonists in the slave revolution. By tracking the colliding worlds of buccaneers, military deserters, and maroon communards from Venezuela to Virginia, Scott records the transmission of contagious mutinies and insurrections in unparalleled detail, providing readers with an intellectual history of the enslaved. Though The Common Wind is credited with having “opened up the Black Atlantic with a rigor and a commitment to the power of written words,” the manuscript remained unpublished for thirty-two years. Now, after receiving wide acclaim from leading historians of slavery and the New World, it has been published by Verso for the first time, with a foreword by the academic and author Marcus Rediker.",
        "Authors": "Julius S. Scott",
        "Publisher": "Verso Books",
        "Published": "2020-09-01",
        "Bagged": "2021-04-25",
        "Pages": "273",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:48:29"
    },
    {
        "ISBN": "9780195398595",
        "Title": "The Iraq Papers",
        "Quantity": 1,
        "Description": "The Iraq Papers will be the most comprehensive and best-organized document collection of America's misadventure in Iraq. The editors have organized the book around the concept of pre-emption, a policy that represented a significant break with past American foreign policy. The editors locatethe intellectual origins of pre-emption in neoconservative writings from the early 1990s, and then trace how the logic of pre-emption played out across a number of arenas in the first decade of the twenty first century: the war itself, America's relationship with its allies and the UN, itsdealings with Iraqi society and successive Iraqi governments after 2003, and domestic policy in the Bush-era United States. They close with a chapter on the limits of American policy as it moves into the Obama era. There are eleven chapters in total, and ten will feature a representative selectionof the most important documents relating to the origins of the war - including prominent writings by early neoconservative advocates for invasion - and the war's impact on Iraq, America, and the world. Covering more than a decade, The Iraq Papers will be a definitive source for anyone interested inunderstanding this enormously complicated and difficult conflict.",
        "Authors": "John Ehrenberg, J. Patrice McSherry, José Ramón Sánchez, Caroleen Marji Sayej",
        "Publisher": "Oxford University Press, USA",
        "Published": "2010-01-01",
        "Bagged": "2020-10-08",
        "Pages": "",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:48:37"
    },
    {
        "ISBN": "9780375423727",
        "Title": "The Information",
        "Quantity": 1,
        "Description": "The best-selling author of Chaos analyzes how information has become a defining quality of the modern era, tracing the evolutions of pivotal information technologies while profiling key contributors from Charles Babbage and Ada Byron to Samuel Morse and Claude Shannon.",
        "Authors": "James Gleick",
        "Publisher": "Pantheon",
        "Published": "2011-01-01",
        "Bagged": "2017-01-31",
        "Pages": "526",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:48:45"
    },
    {
        "ISBN": "9780804136716",
        "Title": "Superforecasting",
        "Quantity": 1,
        "Description": "NEW YORK TIMES BESTSELLER • NAMED ONE OF THE BEST BOOKS OF THE YEAR BY THE ECONOMIST “The most important book on decision making since Daniel Kahneman's Thinking, Fast and Slow.”—Jason Zweig, The Wall Street Journal Everyone would benefit from seeing further into the future, whether buying stocks, crafting policy, launching a new product, or simply planning the week’s meals. Unfortunately, people tend to be terrible forecasters. As Wharton professor Philip Tetlock showed in a landmark 2005 study, even experts’ predictions are only slightly better than chance. However, an important and underreported conclusion of that study was that some experts do have real foresight, and Tetlock has spent the past decade trying to figure out why. What makes some people so good? And can this talent be taught? In Superforecasting, Tetlock and coauthor Dan Gardner offer a masterwork on prediction, drawing on decades of research and the results of a massive, government-funded forecasting tournament. The Good Judgment Project involves tens of thousands of ordinary people—including a Brooklyn filmmaker, a retired pipe installer, and a former ballroom dancer—who set out to forecast global events. Some of the volunteers have turned out to be astonishingly good. They’ve beaten other benchmarks, competitors, and prediction markets. They’ve even beaten the collective judgment of intelligence analysts with access to classified information. They are \"superforecasters.\" In this groundbreaking and accessible book, Tetlock and Gardner show us how we can learn from this elite group. Weaving together stories of forecasting successes (the raid on Osama bin Laden’s compound) and failures (the Bay of Pigs) and interviews with a range of high-level decision makers, from David Petraeus to Robert Rubin, they show that good forecasting doesn’t require powerful computers or arcane methods. It involves gathering evidence from a variety of sources, thinking probabilistically, working in teams, keeping score, and being willing to admit error and change course. Superforecasting offers the first demonstrably effective way to improve our ability to predict the future—whether in business, finance, politics, international affairs, or daily life—and is destined to become a modern classic.",
        "Authors": "Philip E. Tetlock, Dan Gardner",
        "Publisher": "National Geographic Books",
        "Published": "2016-09-13",
        "Bagged": "2016-01-31",
        "Pages": "",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:48:51"
    },
    {
        "ISBN": "9780143125082",
        "Title": "The Signal and the Noise",
        "Quantity": 1,
        "Description": "UPDATED FOR 2020 WITH A NEW PREFACE BY NATE SILVER \"One of the more momentous books of the decade.\" —The New York Times Book Review Nate Silver built an innovative system for predicting baseball performance, predicted the 2008 election within a hair’s breadth, and became a national sensation as a blogger—all by the time he was thirty. He solidified his standing as the nation's foremost political forecaster with his near perfect prediction of the 2012 election. Silver is the founder and editor in chief of the website FiveThirtyEight. Drawing on his own groundbreaking work, Silver examines the world of prediction, investigating how we can distinguish a true signal from a universe of noisy data. Most predictions fail, often at great cost to society, because most of us have a poor understanding of probability and uncertainty. Both experts and laypeople mistake more confident predictions for more accurate ones. But overconfidence is often the reason for failure. If our appreciation of uncertainty improves, our predictions can get better too. This is the “prediction paradox”: The more humility we have about our ability to make predictions, the more successful we can be in planning for the future. In keeping with his own aim to seek truth from data, Silver visits the most successful forecasters in a range of areas, from hurricanes to baseball to global pandemics, from the poker table to the stock market, from Capitol Hill to the NBA. He explains and evaluates how these forecasters think and what bonds they share. What lies behind their success? Are they good—or just lucky? What patterns have they unraveled? And are their forecasts really right? He explores unanticipated commonalities and exposes unexpected juxtapositions. And sometimes, it is not so much how good a prediction is in an absolute sense that matters but how good it is relative to the competition. In other cases, prediction is still a very rudimentary—and dangerous—science. Silver observes that the most accurate forecasters tend to have a superior command of probability, and they tend to be both humble and hardworking. They distinguish the predictable from the unpredictable, and they notice a thousand little details that lead them closer to the truth. Because of their appreciation of probability, they can distinguish the signal from the noise. With everything from the health of the global economy to our ability to fight terrorism dependent on the quality of our predictions, Nate Silver’s insights are an essential read.",
        "Authors": "Nate Silver",
        "Publisher": "National Geographic Books",
        "Published": "2015-02-03",
        "Bagged": "2016-01-31",
        "Pages": "",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:48:57"
    },
    {
        "ISBN": "9781400068920",
        "Title": "Decoded",
        "Quantity": 1,
        "Description": "Decoded is a book like no other: a collection of lyrics and their meanings that together tell the story of a culture, an art form, a moment in history, and one of the most provocative and successful artists of our time. Praise for Decoded “Compelling . . . provocative, evocative . . . Part autobiography, part lavishly illustrated commentary on the author’s own work, Decoded gives the reader a harrowing portrait of the rough worlds Jay-Z navigated in his youth, while at the same time deconstructing his lyrics.”—Michiko Kakutani, The New York Times “One of a handful of books that just about any hip hop fan should own.”—The New Yorker “Elegantly designed, incisively written . . . an impressive leap by a man who has never been known for small steps.”—Los Angeles Times “A riveting exploration of Jay-Z’s journey . . . So thoroughly engrossing, it reads like a good piece of cultural journalism.”—The Boston Globe “Shawn Carter’s most honest airing of the experiences he drew on to create the mythic figure of Jay-Z . . . The scenes he recounts along the way are fascinating.”—Entertainment Weekly “Hip-hop’s renaissance man drops a classic. . . . Heartfelt, passionate and slick.”—Kirkus Reviews (starred review)",
        "Authors": "Jay-Z",
        "Publisher": "One World",
        "Published": "2010-11-16",
        "Bagged": "2015-01-31",
        "Pages": "336",
        "Language": "English",
        "Location": "Unknown",
        "Date": "27/03/2023 14:49:06"
    },
    {
        "ISBN": "9780679775430",
        "Title": "The Wind-up Bird Chronicle",
        "Quantity": 1,
        "Description": "A \"dreamlike and compelling” tour de force (Chicago Tribune)—an astonishingly imaginative detective story, an account of a disintegrating marriage, and an excavation of the buried secrets from Japan’s forgotten campaign in Manchuria during World War II. In a Tokyo suburb, a young man named Toru Okada searches for his wife’s missing cat—and then for his wife as well—in a netherworld beneath the city’s placid surface. As these searches intersect, he encounters a bizarre group of allies and antagonists. Gripping, prophetic, and suffused with comedy and menace, this is one of Haruki Murakami’s most acclaimed and beloved novels.",
        "Authors": "Haruki Murakami",
        "Publisher": "Vintage",
        "Published": "1998-09-01",
        "Bagged": "2023-06-10",
        "Pages": "625",
        "Language": "English",
        "Location": "Unknown",
        "Date": "06/01/2024 08:42:02"
    },
    {
        "ISBN": "9781416591061",
        "Title": "Empire of the Summer Moon",
        "Quantity": 1,
        "Description": "Finalist for the Pulitzer Prize This stunning historical account of the forty-year battle between Comanche Indians and white settlers for control of the American West was a major New York Times bestseller. In the tradition of Bury My Heart at Wounded Knee, a stunningly vivid historical account of the forty-year battle between Comanche Indians and white settlers for control of the American West, centering on Quanah, the greatest Comanche chief of them all. S. C. Gwynne's Empire of the Summer Moon spans two astonishing stories. The first traces the rise and fall of the Comanches, the most powerful Indian tribe in American history. The second entails one of the most remarkable narratives ever to come out of the Old West: the epic saga of the pioneer woman Cynthia Ann Parker and her mixed-blood son Quanah, who became the last and greatest chief of the Comanches. Although readers may be more familiar with the tribal names Apache and Sioux, it was in fact the legendary fighting ability of the Comanches that determined just how and when the American West opened up. Comanche boys became adept bareback riders by age six; full Comanche braves were considered the best horsemen who ever rode. They were so masterful at war and so skillful with their arrows and lances that they stopped the northern drive of colonial Spain from Mexico and halted the French expansion westward from Louisiana. White settlers arriving in Texas from the eastern United States were surprised to find the frontier being rolled backward by Comanches incensed by the invasion of their tribal lands. So effective were the Comanches that they forced the creation of the Texas Rangers and account for the advent of the new weapon specifically designed to fight them: the six-gun. The war with the Comanches lasted four decades, in effect holding up the development of the new American nation. Gwynne's exhilarating account delivers a sweeping narrative that encompasses Spanish colonialism, the Civil War, the destruction of the buffalo herds, and the arrival of the railroads--a historical feast for anyone interested in how the United States came into being. Against this backdrop Gwynne presents the compelling drama of Cynthia Ann Parker, a lovely nine-year-old girl with cornflower-blue eyes who was kidnapped by Comanches from the far Texas frontier in 1836. She grew to love her captors and became infamous as the \"White Squaw\" who refused to return until her tragic capture by Texas Rangers in 1860. More famous still was her son Quanah, a warrior who was never defeated and whose guerrilla wars in the Texas Panhandle made him a legend. S. C. Gwynne's account of these events is meticulously researched, intellectually provocative, and, above all, thrillingly told. Empire of the Summer Moon announces him as a major new writer of American history.",
        "Authors": "S. C. Gwynne",
        "Publisher": "Simon and Schuster",
        "Published": "2010-01-01",
        "Bagged": "2023-07-18",
        "Pages": "400",
        "Language": "English",
        "Location": "Unknown",
        "Date": "06/01/2024 08:42:24"
    },
    {
        "ISBN": "9781571313560",
        "Title": "Braiding Sweetgrass",
        "Quantity": 1,
        "Description": "\"As a leading researcher in the field of biology, Robin Wall Kimmerer understands the delicate state of our world. But as an active member of the Potawatomi nation, she senses and relates to the world through a way of knowing far older than any science. In Braiding Sweetgrass, she intertwines these two modes of awareness--the analytic and the emotional, the scientific and the cultural--to ultimately reveal a path toward healing the rift that grows between people and nature. The woven essays that construct this book bring people back into conversation with all that is green and growing; a universe that never stopped speaking to us, even when we forgot how to listen\"--",
        "Authors": "Robin Wall Kimmerer",
        "Publisher": "",
        "Published": "2014-09-01",
        "Bagged": "2023-06-26",
        "Pages": "390",
        "Language": "English",
        "Location": "Unknown",
        "Date": "06/01/2024 08:42:51"
    },
    {
        "ISBN": "9781250045065",
        "Title": "Kill Anything that Moves",
        "Quantity": 1,
        "Description": "Based on classified documents and first-person interviews, a startling history of the American war on Vietnamese civilians The American Empire Project Winner of the Ridenhour Prize for Reportorial Distinction Americans have long been taught that events such as the notorious My Lai massacre were isolated incidents in the Vietnam War, carried out by just a few \"bad apples.\" But as award-winning journalist and historian Nick Turse demonstrates in this groundbreaking investigation, violence against Vietnamese noncombatants was not at all exceptional during the conflict. Rather, it was pervasive and systematic, the predictable consequence of official orders to \"kill anything that moves.\" Drawing on more than a decade of research into secret Pentagon archives and extensive interviews with American veterans and Vietnamese survivors, Turse reveals for the first time the workings of a military machine that resulted in millions of innocent civilians killed and wounded--what one soldier called \"a My Lai a month.\" Devastating and definitive, Kill Anything That Moves finally brings us face-to-face with the truth of a war that haunts America to this day.",
        "Authors": "Nick Turse",
        "Publisher": "Picador",
        "Published": "2013-12-31",
        "Bagged": "2023-08-07",
        "Pages": "416",
        "Language": "English",
        "Location": "Unknown",
        "Date": "06/01/2024 08:43:32"
    },
    {
        "ISBN": "9780140441239",
        "Title": "The Conquest of New Spain",
        "Quantity": 1,
        "Description": "Recollections of the conquest of New Spain describes the various expeditions, marches, embassies, important leaders, sieges, and captures.",
        "Authors": "Bernal Diaz del Castillo",
        "Publisher": "Penguin UK",
        "Published": "1963-01-01",
        "Bagged": "2023-10-21",
        "Pages": "609",
        "Language": "English",
        "Location": "Unknown",
        "Date": "06/01/2024 16:44:16"
    },
    {
        "ISBN": "9780393317558",
        "Title": "Guns, Germs, and Steel",
        "Quantity": 1,
        "Description": "The fates of human societies.",
        "Authors": "Jared M. Diamond, Professor of Geography Jared Diamond",
        "Publisher": "W. W. Norton",
        "Published": "1999-01-01",
        "Bagged": "2023-12-01",
        "Pages": "532",
        "Language": "English",
        "Location": "Unknown",
        "Date": "06/01/2024 16:44:38"
    },
    {
        "ISBN": "9780060987107",
        "Title": "Wicked",
        "Quantity": 1,
        "Description": "When Dorothy triumphed over the Wicked Witch of the West in L. Frank Baum's classic tale, we heard only her side of the story. But what about her arch-nemesis, the mysterious witch? Where did she come from? How did she become so wicked? And what is the true nature of evil? Gregory Maguire creates a fantasy world so rich and vivid that we will never look at Oz the same way again. Wicked is about a land where animals talk and strive to be treated like first-class citizens, Munchkinlanders seek the comfort of middle-class stability and the Tin Man becomes a victim of domestic violence. And then there is the little green-skinned girl named Elphaba, who will grow up to be the infamous Wicked Witch of the West, a smart, prickly and misunderstood creature who challenges all our preconceived notions about the nature of good and evil.",
        "Authors": "Gregory Maguire",
        "Publisher": "Harper Collins",
        "Published": "1996-09-27",
        "Bagged": "2023-12-05",
        "Pages": "430",
        "Language": "English",
        "Location": "Unknown",
        "Date": "06/01/2024 16:45:21"
    }
]