[{"ISBN":"9780140441239","Title":"The Conquest of New Spain","Quantity":1,"Description":"Recollections of the conquest of New Spain describes the various expeditions, marches, embassies, important leaders, sieges, and captures.","Authors":"Bernal Diaz del Castillo","Publisher":"Penguin UK","Published":"1963-01-01","Bagged":"2023-10-06","Pages":"609","Language":"English","Location":"Unknown","Date":"06/02/2024 17:36:18"},{"ISBN":"9780393317558","Title":"Guns, Germs, and Steel","Quantity":1,"Description":"The fates of human societies.","Authors":"Jared M. Diamond, Professor of Geography Jared Diamond","Publisher":"W. W. Norton","Published":"1999-01-01","Bagged":"2023-11-16","Pages":"532","Language":"English","Location":"Unknown","Date":"06/02/2024 17:38:29"},{"ISBN":"9780060987107","Title":"Wicked","Quantity":1,"Description":"When Dorothy triumphed over the Wicked Witch of the West in L. Frank Baum's classic tale, we heard only her side of the story. But what about her arch-nemesis, the mysterious witch? Where did she come from? How did she become so wicked? And what is the true nature of evil? Gregory Maguire creates a fantasy world so rich and vivid that we will never look at Oz the same way again. Wicked is about a land where animals talk and strive to be treated like first-class citizens, Munchkinlanders seek the comfort of middle-class stability and the Tin Man becomes a victim of domestic violence. And then there is the little green-skinned girl named Elphaba, who will grow up to be the infamous Wicked Witch of the West, a smart, prickly and misunderstood creature who challenges all our preconceived notions about the nature of good and evil.","Authors":"Gregory Maguire","Publisher":"Harper Collins","Published":"1996-09-27","Bagged":"2023-12-22","Pages":"430","Language":"English","Location":"Unknown","Date":"06/02/2024 17:39:00"},{"ISBN":"9781593082093","Title":"Common Sense and Other Writings","Quantity":1,"Description":"Thomas Paine was an important leader in the fight for independence from England. His pamphlet Common Sense stirred the populace to join the fight.","Authors":"Thomas Paine","Publisher":"Barnes & Noble Classics","Published":"2005-01-01","Bagged":"2020-05-22","Pages":"438","Language":"English","Location":"Unknown","Date":"06/02/2024 17:03:53"},{"ISBN":"9780553274325","Title":"Johnny Got His Gun","Quantity":1,"Description":"“Trumbo sets this story down almost without pause or punctuation and with a fury accounting to eloquence.”—The New York Times This was no ordinary war. This was a war to make the world safe for democracy. And if democracy was made safe, then nothing else mattered—not the millions of dead bodies, nor the thousands of ruined lives. . . . This is no ordinary novel. This is a novel that never takes the easy way out: it is shocking, violent, terrifying, horrible, uncompromising, brutal, remorseless and gruesome . . . but so is war.","Authors":"Dalton Trumbo","Publisher":"Bantam","Published":"1970-01-01","Bagged":"2021-01-31","Pages":"260","Language":"English","Location":"Unknown","Date":"06/02/2024 17:05:26"},{"ISBN":"9780553214642","Title":"Democracy in America: the Complete and Unabridged Volumes I and Ii","Quantity":1,"Description":"From America's call for a free press to its embrace of the capitalist system, this book endures as a brilliant study of our national government and character. This title contains the complete text of both volumes of the classic work.","Authors":"Alexis De Tocqueville","Publisher":"Bantam Classics","Published":"2000-04-04","Bagged":"2020-04-02","Pages":"996","Language":"English","Location":"Unknown","Date":"06/02/2024 17:07:21"},{"ISBN":"9780802716743","Title":"Ghosts of Spain","Quantity":1,"Description":"An eloquent odyssey through Spain's dark history journeys into the heart of the Spanish Civil War to examine the causes and consequences of a painful recent past, as well as its repercussions in terms of the discovery of mass graves containing victims of Franco's death squads and the lives of modern-day Spaniards. Reprint.","Authors":"Giles Tremlett","Publisher":"Bloomsbury Publishing USA","Published":"2008-03-13","Bagged":"2024-02-02","Pages":"402","Language":"English","Location":"Unknown","Date":"06/02/2024 17:09:09"},{"ISBN":"9780140187458","Title":"The Long Valley","Quantity":1,"Description":"A Penguin Classic First published in 1938, this volume of stories collected with the encouragement of his longtime editor Pascal Covici serves as a wonderful introduction to the work of Nobel Prize winner John Steinbeck. Set in the beautiful Salinas Valley of California, where simple people farm the land and struggle to find a place for themselves in the world, these stories reflect Steinbeck’s characteristic interests: the tensions between town and country, laborers and owners, past and present. Included here are the O. Henry Prize-winning story “The Murder”; “The Chrysanthemums,” perhaps Steinbeck’s most challenging story, both personally and artistically; “Flight,” “The Snake,” “The White Quail,” and the classic tales of “The Red Pony.” With an introduction and notes by John H. Timmerman. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.","Authors":"John Steinbeck","Publisher":"Penguin","Published":"1995-08-01","Bagged":"2017-01-31","Pages":"273","Language":"English","Location":"Unknown","Date":"06/02/2024 17:10:32"},{"ISBN":"9781593081218","Title":"Uncle Tom's Cabin","Quantity":1,"Description":"The story of American slavery and Uncle Tom, an African-American man who never lost his dignity under the most inhumane circumstances.","Authors":"Harriet Beecher Stowe","Publisher":"Barnes & Noble classics","Published":"2005-01-30","Bagged":"2020-04-13","Pages":"454","Language":"English","Location":"Unknown","Date":"06/02/2024 17:13:29"},{"ISBN":"9781593080143","Title":"The Souls of Black Folk","Quantity":1,"Description":"One of the most influential books ever published in America, W. E. B. Du Bois's The Souls of Black Folk is an eloquent collection of fourteen essays that describe the life, the ambitions, the struggles, and the passions of African Americans at the transition from the nineteenth to the twentieth century. The first African American to receive a Ph.D. from Harvard University, Du Bois was a sociologist, historian, novelist, and activist whose astounding career spanned the nation's history from Reconstruction to the Civil Rights Movement. In The Souls of Black Folk, published in 1903, Du Bois argued against the conciliatory position taken by Booker T. Washington, at the time the most influential black leader in America, and called for a more radical form of aggressive protest--a strategy that would anticipate and inspire much of the activism of the 1960s. Du Bois's essays were the first to articulate many of Black America's thoughts and feelings, including the dilemma posed by the black psyche's \"double consciousness,\" which Du Bois described as \"this twoness--an American, a Negro; two souls, two thoughts, two unreconciled strivings . . . in one dark body.\" Every essay in The Souls of Black Folk is a jewel of intellectual prowess, eloquent language, and groundbreaking insight. It is essential reading for anyone interested in the struggle for Civil Rights in America. --Publisher.","Authors":"W. E. B. Du Bois","Publisher":"Barnes & Noble Publishing","Published":"2003-01-01","Bagged":"2020-07-16","Pages":"236","Language":"English","Location":"Unknown","Date":"06/02/2024 17:15:00"},{"ISBN":"9780684169408","Title":"Nick Adams Stories","Quantity":1,"Description":"From one of the 20th century's greatest voices comes the complete chronological anthology of his short stories featuring Nick Adams, Ernest Hemingway's memorable character, as he grows from child to adolescent to soldier, veteran, writer, and parent—a sequence closely paralleling the events of Hemingway's life. The complete collection of Ernest Hemingway's Nick Adams two dozen stories are gathered here in one volume, grouped together according to the major time periods in the protagonist's life. Based on Hemingway's own experiences as a boy and as a member of the Red Cross ambulance corps in World War I. The collection follows Nick's life as a child to parent, along with soldier, veteran, and writer and feature some of Hemingway's earliest work such as \"Indian Camp\" and some of his best-known short stories, including \"Big Two-Hearted River.\" Perfect for longtime Hemingway fans and as an introduction to one of America's most famous writers.","Authors":"Ernest Hemingway","Publisher":"Scribner","Published":"1972-01-01","Bagged":"2016-01-31","Pages":"276","Language":"English","Location":"Unknown","Date":"06/02/2024 17:17:47"},{"ISBN":"9780871403353","Title":"Tropic Death","Quantity":1,"Description":"Finally available after three decades, a lost classic of the Harlem Renaissance that Langston Hughes acclaimed for its “hard poetic beauty.” Eric Walrond (1898–1966), in his only book, injected a profound Caribbean sensibility into black literature. His work was closest to that of Jean Toomer and Zora Neale Hurston with its striking use of dialect and its insights into the daily lives of the people around him. Growing up in British Guiana, Barbados, and Panama, Walrond first published Tropic Death to great acclaim in 1926. This book of stories viscerally charts the days of men working stone quarries or building the Panama Canal, of women tending gardens and rearing needy children. Early on addressing issues of skin color and class, Walrond imbued his stories with a remarkable compassion for lives controlled by the whims of nature. Despite his early celebrity, he died in London in 1966 with minimal recognition given to his passing. Arnold Rampersad’s elegant introduction reclaims this classic work and positions Walrond alongside the prominent writers of his age.","Authors":"Eric Walrond","Publisher":"National Geographic Books","Published":"2013-01-15","Bagged":"2020-10-31","Pages":"","Language":"English","Location":"Unknown","Date":"06/02/2024 17:18:33"},{"ISBN":"9780743244589","Title":"Chronicles","Quantity":1,"Description":"WINNER OF THE NOBEL PRIZE IN LITERATURE The celebrated first memoir from arguably the most influential singer-songwriter in the country, Bob Dylan. “I’d come from a long ways off and had started a long ways down. But now destiny was about to manifest itself. I felt like it was looking right at me and nobody else.” So writes Bob Dylan in Chronicles: Volume One, his remarkable book exploring critical junctures in his life and career. Through Dylan’s eyes and open mind, we see Greenwich Village, circa 1961, when he first arrives in Manhattan. Dylan’s New York is a magical city of possibilities—smoky, nightlong parties; literary awakenings; transient loves and unbreakable friendships. Elegiac observations are punctuated by jabs of memories, penetrating and tough. With the book’s side trips to New Orleans, Woodstock, Minnesota, and points west, Chronicles: Volume One is an intimate and intensely personal recollection of extraordinary times. By turns revealing, poetical, passionate, and witty, Chronicles: Volume One is a mesmerizing window on Bob Dylan’s thoughts and influences. Dylan’s voice is distinctively American: generous of spirit, engaged, fanciful, and rhythmic. Utilizing his unparalleled gifts of storytelling and the exquisite expressiveness that are the hallmarks of his music, Bob Dylan turns Chronicles: Volume One into a poignant reflection on life, and the people and places that helped shape the man and the art.","Authors":"Bob Dylan","Publisher":"Simon & Schuster","Published":"2005-09-13","Bagged":"2017-01-31","Pages":"","Language":"English","Location":"Unknown","Date":"06/02/2024 17:19:57"},{"ISBN":"9780805017304","Title":"Bury My Heart at Wounded Knee","Quantity":1,"Description":"A true classic of American history, Bury My Heart at Wounded Knee is Dee Brown’s eloquent, meticulously documented account of the systematic destruction of the American Indian during the second half of the nineteenth century. Using council records, autobiographies, and firsthand descriptions, Brown allows the great chiefs and warriors of the Dakota, Ute, Sioux, Cheyenne, and other tribes to tell in their won words of the battles, massacres, and broken treaties that finally left them demoralized and defeated. A unique and disturbing narrative told with force and clarity, this book changed forever our vision of how the West was really won.","Authors":"Dee Brown","Publisher":"Holt Paperbacks","Published":"1991-03-15","Bagged":"2015-01-31","Pages":"516","Language":"English","Location":"Unknown","Date":"06/02/2024 17:20:43"},{"ISBN":"9780375703768","Title":"House of Leaves","Quantity":1,"Description":"“A novelistic mosaic that simultaneously reads like a thriller and like a strange, dreamlike excursion into the subconscious.” —The New York Times Years ago, when House of Leaves was first being passed around, it was nothing more than a badly bundled heap of paper, parts of which would occasionally surface on the Internet. No one could have anticipated the small but devoted following this terrifying story would soon command. Starting with an odd assortment of marginalized youth -- musicians, tattoo artists, programmers, strippers, environmentalists, and adrenaline junkies -- the book eventually made its way into the hands of older generations, who not only found themselves in those strangely arranged pages but also discovered a way back into the lives of their estranged children. Now this astonishing novel is made available in book form, complete with the original colored words, vertical footnotes, and second and third appendices. The story remains unchanged, focusing on a young family that moves into a small home on Ash Tree Lane where they discover something is terribly wrong: their house is bigger on the inside than it is on the outside. Of course, neither Pulitzer Prize-winning photojournalist Will Navidson nor his companion Karen Green was prepared to face the consequences of that impossibility, until the day their two little children wandered off and their voices eerily began to return another story -- of creature darkness, of an ever-growing abyss behind a closet door, and of that unholy growl which soon enough would tear through their walls and consume all their dreams.","Authors":"Mark Z. Danielewski","Publisher":"Pantheon","Published":"2000-01-01","Bagged":"2017-01-31","Pages":"742","Language":"English","Location":"Unknown","Date":"06/02/2024 17:22:12"},{"ISBN":"9780805210644","Title":"Amerika","Quantity":1,"Description":"Depicts the tragicomic misadventures of a young immigrant in New York.","Authors":"Franz Kafka","Publisher":"Random House LLC","Published":"1996-01-01","Bagged":"2015-01-31","Pages":"340","Language":"English","Location":"Unknown","Date":"06/02/2024 17:22:58"},{"ISBN":"9780030565816","Title":"Long Walk to Freedom with Connections","Quantity":1,"Description":"Presents Nelson Mandela's autobiography and includes ten writings by other authors, including book excerpts, poems, short stories, and song lyrics, on Mandela, South Africa, or themes like those that shaped his life.","Authors":"Nelson Mandela","Publisher":"Holt McDougal","Published":"2000-01-01","Bagged":"2015-01-31","Pages":"","Language":"English","Location":"Unknown","Date":"06/02/2024 17:24:03"},{"ISBN":"9781505818390","Title":"Homage to Catalonia","Quantity":1,"Description":"A first-hand account of the brutal conditions of the Spanish Civil War, George Orwell's 'Homage to Catalonia'. \"Every line of serious work that I have written since 1936 has been written, directly or indirectly, against totalitarianism and for democratic Socialism as I understand it\". Thus wrote Orwell following his experiences as a militiaman in the Spanish Civil War, chronicled in Homage to Catalonia. Here he brings to bear all the force of his humanity, passion and clarity, describing with bitter intensity the bright hopes and cynical betrayals of that chaotic episode: the revolu-tionary euphoria of Barcelona, the courage of ordinary Spanish men and women he fought alongside, the terror and confusion of the front, his near-fatal bullet wound and the vicious treachery of his supposed allies. Check out our other books at www.dogstailbooks.co.uk","Authors":"George Orwell","Publisher":"","Published":"2014-12-29","Bagged":"2015-01-31","Pages":"174","Language":"English","Location":"Unknown","Date":"06/02/2024 17:25:08"},{"ISBN":"9781476708706","Title":"The Innovators","Quantity":1,"Description":"\"Following his blockbuster biography of Steve Jobs, The Innovators is Walter Isaacson's revealing story of the people who created the computer and the Internet. It is destined to be the standard history of the digital revolution and an indispensable guide to how innovation really happens. What were the talents that allowed certain inventors and entrepreneurs to turn their visionary ideas into disruptive realities? What led to their creative leaps? Why did some succeed and others fail? In his masterly saga, Isaacson begins with Ada Lovelace, Lord Byron's daughter, who pioneered computer programming in the 1840s. He explores the fascinating personalities that created our current digital revolution, such as Vannevar Bush, Alan Turing, John von Neumann, J.C.R. Licklider, Doug Engelbart, Robert Noyce, Bill Gates, Steve Wozniak, Steve Jobs, Tim Berners-Lee, and Larry Page. This is the story of how their minds worked and what made them so inventive. It's also a narrative of how their ability to collaborate and master the art of teamwork made them even more creative. For an era that seeks to foster innovation, creativity, and teamwork, The Innovators shows how they happen\"--","Authors":"Walter Isaacson","Publisher":"Simon and Schuster","Published":"2014-01-01","Bagged":"2016-01-31","Pages":"560","Language":"English","Location":"Unknown","Date":"06/02/2024 17:26:14"},{"ISBN":"9780316066525","Title":"Infinite Jest","Quantity":1,"Description":"The story of an intelligent but zany dysfunctional family is set in a drug-and-alcohol addicts' halfway house and a tennis academy and follows such themes as heartbreak, philosophy, and advertising.","Authors":"David Foster Wallace","Publisher":"Back Bay Books","Published":"2006-11-13","Bagged":"2015-01-31","Pages":"1079","Language":"English","Location":"Unknown","Date":"06/02/2024 17:26:41"}]